<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PostSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('posts')->insert([
            [
                'title' => '10 نصائح للعناية بالبشرة في الشتاء',
                'image' => 'https://example.com/skin_care.jpg',
                'content' => 'في فصل الشتاء، تحتاج بشرتك إلى عناية خاصة للحفاظ على صحتها وجمالها. في هذه المقالة، سنقدم لك 10 نصائح للعناية بالبشرة في الشتاء، بما في ذلك استخدام مرطبات طبيعية، وحماية البشرة من أشعة الشمس، والاعتناء بالتغذية الصحية.',
                'category_id' => 1,
                'client_id' => 1
            ],
            [
                'title' => 'كيفية التغلب على الإجهاد في العمل',
                'image' => 'https://example.com/stress.jpg',
                'content' => 'يعتبر الإجهاد أحد التحديات الرئيسية التي يواجهها العاملون في العصر الحديث. في هذه المقالة، سنتناول بعض الاستراتيجيات الفعالة للتغلب على الإجهاد في مكان العمل، مثل ممارسة التنفس العميق، وتنظيم الوقت، واتباع نمط حياة صحي.',
                'category_id' => 2,
                'client_id' => 1
            ],
            [
                'title' => 'فوائد الرياضة للصحة العقلية',
                'image' => 'https://example.com/mental_health.jpg',
                'content' => 'تعد ممارسة الرياضة أحد الطرق الفعّالة لتحسين الصحة العقلية. في هذه المقالة، سنتحدث عن بعض الفوائد الرئيسية لممارسة الرياضة للصحة العقلية، مثل تقليل مستويات الإجهاد وتحسين مزاجك وتعزيز الشعور بالسعادة والراحة النفسية.',
                'category_id' => 3,
                'client_id' => 1
            ],
            [
                'title' => 'طرق فعالة لتحسين نومك',
                'image' => 'https://example.com/sleep.jpg',
                'content' => 'النوم الجيد يلعب دورًا هامًا في الحفاظ على صحة جسمك وعقلك. في هذه المقالة، سنقدم بعض الطرق الفعالة لتحسين نومك، مثل تحديد وقت النوم، وإنشاء بيئة نوم مريحة، وممارسة التمارين الرياضية بانتظام.',
                'category_id' => 1,
                'client_id' => 1
            ],
            [
                'title' => 'فوائد تناول الخضروات والفواكه',
                'image' => 'https://example.com/fruits_vegetables.jpg',
                'content' => 'تحتوي الخضروات والفواكه على العديد من الفوائد الصحية، بما في ذلك تقوية جهاز المناعة',
                'category_id' => 1,
                'client_id' => 1
            ]
            ]);
    }}

